#Список в строку и обратно
# a = '55, 5.5, "This text", False, True, (2 + 1j)'
# a = a.split()
# print(a)
# print(''.join(a))
# print('Разделитель'.join(a))

# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки. n/
# Строки необходимо пронумеровать. Если в слово длинное, выводить только первые 10 букв в слове.

mylist = input("Введите слова через пробелы - ").split()
for a, word in enumerate(mylist, 1):
    print(f'{a}, {word[:10]}')