# Создать текстовый файл (не программно). Построчно записать фамилии сотрудников и величину их окладов (не менее 10 строк).
# Определить, кто из сотрудников имеет оклад менее 20 тысяч, вывести фамилии этих сотрудников.
# Выполнить подсчёт средней величины дохода сотрудников.
# Пример файла:
# Иванов 23543.12
# Петров 13749.32

with open('Text3.txt', 'r', encoding='utf-8') as f:
   made_dict = {line.split()[0]: float(line.split()[1]) for line in f}
   print('Средняя зарплата по цеху :-', (sum(made_dict.values()) / len(made_dict)))
   print('Сотрудники с оплатой ниже 20000:- ', [e[0] for e in made_dict.items() if e[1] < 20000])













