# s = 'abrakadabra'
# print(s[1:4])
# Выполнить функцию, которая принимает несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Осуществить вывод данных о пользователе одной строкой.

def data(**kwargs):
    print('list:- ', kwargs)
a = {
    'имя': input('Введите ваше имя '),
    'фамилия': input('Введите вашу фамилию '),
    'год рождения': input('Введите ваш год рождения '),
    'город проживания': input('Введите ваш город проживания '),
    'email': input('Введите вашу эпочту '),
    'телефон': input('Введите ваш телефон ')
    }
data(**a)

