# Реализовать скрипт, в котором должна быть предусмотрена функция расчёта заработной платы сотрудника.
# Используйте в нём формулу: (выработка в часах*ставка в час) + премия.
#Во время выполнения расчёта для конкретных значений необходимо запускать скрипт с параметрами.


from sys import argv
def Maney():
    try:
        V_hours, n_hour, bonus = map(float, argv[1:])


        print("Выработка в часах: ", V_hours)
        print("Норма-час: ", n_hour)
        print("Бонус: ", bonus)
        print(f"Зарплата сотруника на руки - {V_hours * n_hour + bonus}")
    except ValueError:
        print('Повторяю: введите выработку в часах, норма-час, премия:')

Maney()
