# 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

def my_func():
    a = int(input('Введите числитель '))
    b = int(input('Введите знаменатель '))
    if b == 0:
        print("Введите любое число, кроме 0 ")
    else:
        print(a / b)
my_func()

