# . Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.

def func(x, y):
    try:
        x, y = float(x), int(y)
        if x >= 0 or y <= 0:
            return 'Введите правильно: х > 0 , y < 0'
        else:
            c = 1
            for _ in range(abs(y)):
                c *= 1 / x
        return f'Итог возведения x в степень y: {round((c, 6))}'
    except ValueError:
        return 'Программа работает только с числами'
print(func(2, -3))


















